HA_1C/Catalogs/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Автомобили</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПриобретения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РегламентныеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РегламентнаяРабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РегламентныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Интервал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HA_1C/Catalogs/Автомобили/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
// На мобильном приложении текущая строка теряется, поэтому сохраняем в переменной
Перем ТекСтрокаТЗ;

#Область ОбработчикиТЧРегламентныеРаботы

&НаКлиенте
Процедура ДобавитьРаботу(Команда)
	ТекСтрокаХарактеристики = Неопределено;
	ОткрытьФормуВыбора();
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеРаботыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтрокаТЗ = Неопределено Тогда
		ТекСтрока = Объект.РегламентныеРаботы.Добавить();
		Элементы.РегламентныеРаботы.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	Иначе
		ТекСтрока = ТекСтрокаТЗ;
	КонецЕсли;
	Элементы.РегламентныеРаботы.ТекущийЭлемент = Неопределено;
	ТекСтрока.РегламентнаяРабота = ВыбранноеЗначение;
	ТекСтрока.Интервал = 12;

КонецПроцедуры

&НаКлиенте
Процедура РегламентныеРаботыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекСтрокаТЗ = Элементы.РегламентныеРаботы.ТекущиеДанные;
	ОткрытьФормуВыбора();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФормы

&НаКлиенте
Процедура ОткрытьФормуВыбора()
	
	ОткрытьФорму("Справочник.РегламентныеРаботы.ФормаВыбора",, Элементы.РегламентныеРаботы);
	
КонецПроцедуры

#КонецОбласти
